using PickyBride.Data.Entities;

namespace pickyPride2;

public class SimpleContenderGenerator : IContenderGenerator
{
    private const int GroomsCount = 100;
    private static readonly string[] Surnames =
    {
        "Смирнов",
        "Иванов",
        "Кузнецов",
        "Соколов",
        "Попов",
        "Лебедев",
        "Козлов",
        "Новиков",
        "Морозов",
        "Петров",
        "Волков",
        "Соловьёв",
        "Васильев",
        "Зайцев",
        "Павлов",
        "Семёнов",
        "Голубев",
        "Виноградов",
        "Богданов",
        "Воробьёв",
        "Фёдоров",
        "Михайлов",
        "Беляев",
        "Тарасов",
        "Белов",
        "Комаров",
        "Орлов",
        "Киселёв",
        "Макаров",
        "Андреев",
        "Ковалёв",
        "Ильин",
        "Гусев",
        "Титов",
        "Кузьмин",
        "Кудрявцев",
        "Баранов",
        "Куликов",
        "Алексеев",
        "Степанов",
        "Яковлев",
        "Сорокин",
        "Сергеев",
        "Романов",
        "Захаров",
        "Борисов",
        "Королёв",
        "Герасимов",
        "Пономарёв",
        "Григорьев",
        "Лазарев",
        "Медведев",
        "Ершов",
        "Никитин",
        "Соболев",
        "Рябов",
        "Поляков",
        "Цветков",
        "Данилов",
        "Жуков",
        "Фролов",
        "Журавлёв",
        "Николаев",
        "Крылов",
        "Максимов",
        "Сидоров",
        "Осипов",
        "Белоусов",
        "Федотов",
        "Дорофеев",
        "Егоров",
        "Матвеев",
        "Бобров",
        "Дмитриев",
        "Калинин",
        "Анисимов",
        "Петухов",
        "Антонов",
        "Тимофеев",
        "Никифоров",
        "Веселов",
        "Филиппов",
        "Марков",
        "Большаков",
        "Суханов",
        "Миронов",
        "Ширяев",
        "Александров",
        "Коновалов",
        "Шестаков",
        "Казаков",
        "Ефимов",
        "Денисов",
        "Громов",
        "Фомин",
        "Давыдов",
        "Мельников",
        "Щербаков",
        "Блинов",
        "Колесников"
    };

    private static readonly string[] Names =
    {
        "Григорий", "Лев", "Андрей", "Роман", "Арсений", "Степан", "Владислав", "Никита",
        "Глеб", "Марк", "Давид", "Ярослав", "Евгений", "Матвей", "Фёдор", "Николай", "Алексей",
        "Андрей", "Артемий", "Виктор", "Никита", "Даниил", "Денис", "Егор", "Игорь", "Лев",
        "Леонид", "Павел", "Петр", "Роман", "Руслан", "Сергей", "Семён", "Тимофей"
    };

    private static string[] GenerateNames()
    {
        var random = new Random();
        var result = new string[100];
        for (var i = 0; i < 100; i++)
        {
            var x = Names.Length;
            result[i] = Names[random.Next(0, Names.Length)] + " " + Surnames[i];
        }

        return result;
    }
    public Contender[] GenerateGrooms()
    {
        Contender[] grooms = new Contender[GroomsCount];
        var rand = new Random();
        var ratings = Enumerable.Range(1, GroomsCount).OrderBy(x => rand.Next()).ToArray();
        var names = GenerateNames();
        for (var i = 0; i < GroomsCount; i++)
        {
            grooms[i] = new Contender(names[i], ratings[i]);
        }

        return grooms;
    }

    public SimpleContenderGenerator()
    {
    }
}